/*************************************************************************
	> File Name: 1阿拉伯转罗马.c
	> Author: 
	> Mail: 
	> Created Time: Fri 14 Apr 2017 03:38:59 PM PDT
 ************************************************************************/

#include<stdio.h>
int main()
{
    char *a[][10] = {"", "|", "||", "|||", "|V", "V", "V|", "V||", "V|||", "|X",
                     "", "X", "XX", "XXX", "XL", "L", "LX", "LXX", "LXXX", "XC",
                     "", "C", "CC", "CCC", "CD", "D", "DC", "DCC", "DCCC", "CM"};//建立对照表

    int m, t;
    printf("请输入任意一个正整数：\n");
    scanf("%d", &m);

    int i = 1000;
    for(int n = 0; n < 3; ++n)
    {
        t = (m%i) / (i/10);//从高位到低位取各位数字
        i /= 10;
        printf("%s", a[2-n][t]);
    }
    return 0;
}
